tap "homebrew/bundle"
tap "oven-sh/bun"
brew "direnv"
brew "docker"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "pinentry"
brew "gnupg"
brew "go-task"
brew "hub"
brew "jq"
brew "libpq"
brew "make"
brew "neovim"
brew "node"
brew "ollama"
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "pre-commit"
brew "pstree"
brew "python@3.12"
brew "ripgrep"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxp"
brew "uv"
brew "wget"
brew "ykman"
brew "ykpers"
brew "oven-sh/bun/bun"
cask "1password-cli"
cask "alfred"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "docker"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "notion-calendar"
cask "pycharm"
cask "warp"
cask "yubico-yubikey-manager"
