tap "homebrew/bundle"
tap "oven-sh/bun"
brew "argocd"
brew "ast-grep"
brew "bash-completion@2"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "pinentry"
brew "gnupg"
brew "go-task"
brew "hub"
brew "jq"
brew "lazygit"
brew "libpq"
brew "make"
brew "neovim"
brew "nvm"
brew "ollama"
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "postgresql@14"
brew "pre-commit"
brew "prek"
brew "pstree"
brew "ripgrep"
brew "temporal"
brew "the_silver_searcher"
brew "tmux"
brew "tmuxp"
brew "tree-sitter-cli"
brew "uv"
brew "wget"
brew "ykman"
brew "ykpers"
brew "yq"
brew "oven-sh/bun/bun"
cask "1password-cli"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "ngrok"
cask "notion-calendar"
cask "raycast"
cask "yubico-yubikey-manager"
